Repository: TalatMasud-OmniaPayments/BDM
Catalog: BDM-ALRAJHI/Omnia.Pie.Bdm/Omnia.Pie.Bdm.Bootstrapper/Properties/Resources.*.resx
Languages: ar_ae

# LabelOutstandingBalanceColon
source: Outstanding Balance:
ar_ae: المبلغ المستحق

# LabelOutstandingDue
source: Outstanding Due
ar_ae: المستحقات

# LabelPaymentDetails
source: Payment Details
ar_ae: تفاصيل الدفعات

# LabelPaymentDetailsColon
source: Payment Details:
ar_ae: تفاصيل الدفعات

# LabelPaymentDueDateColon
source: Payment Due Date:
ar_ae: تاريخ استحقاق الدفعة

# LabelPhoneColon
source: Phone:
ar_ae: الهاتف

# LabelPhoneNumber
source: Phone Number
ar_ae: رقم الهاتف

# LabelPoBoxNo
source: P.O. Box No
ar_ae: رقم صندوق البريد

# LabelPostingDate
source: Posting Date
ar_ae: تاريخ القيد

# LabelPrincipalAmountColon
source: Principal Amount:
ar_ae: المبلغ الرئيسي

# LabelPromotion
source: To speak to an agent about current offers and promotions please tap the button below.
ar_ae: للتحدث إلى مندوب حول العروض الترويجية الحالية، يرجى الضغط على الزر أدناه

# LabelRechargeAmount
source: Recharge Amount
ar_ae: مبلغ إعادة الشحن

# LabelRechargeAmountColon
source: Recharge Amount:
ar_ae: مبلغ إعادة الشحن

# LabelReferenceNumberColon
source: Reference Number:
ar_ae: رقم المرجع

# LabelRelationship
source: Relationship
ar_ae: العلاقة

# LabelRemaining
source: remaining
ar_ae: متبقي

# LabelRemittance
source: Remittance
ar_ae: الحوالات

# LabelRetard
source: Do you need more time ?
ar_ae: هل تحتاج إلى مزيد من الوقت؟

# LabelRotateCheque
source: Please tap on the cheque image to rotate.
ar_ae: الرجاء الضغط على صورة الشيك للتدوير

# LabelSalary
source: Salary
ar_ae: الراتب

# LabelSalik
source: Salik
ar_ae: سالك

# LabelSalikConsumerNumber
source: Salik Consumer Number
ar_ae: رقم المستهلك في سالك

# LabelSalikConsumerNumberColon
source: Salik Consumer Number:
ar_ae: رقم المستهلك في سالك

# LabelSalikPinNumber
source: Salik PIN Number
ar_ae: رقم التعريف الشخصي لسالك

# LabelSalikPinNumberColon
source: Salik PIN Number:
ar_ae: رقم التعريف الشخصي لسالك

# LabelSavings
source: Savings
ar_ae: التوفير

# LabelSavingsAccountCode
source: Savings Account
ar_ae: حساب التوفير

# LabelSelectAccount
source: Please select your account
ar_ae: الرجاء تحديد حسابك

# LabelSelectAccountWatermark
source: Select an account.
ar_ae: حدد الحساب

# LabelSelectCreditCard
source: Select Credit Card
ar_ae: حدد بطاقة الائتمان

# LabelSelectCreditCardWatermark
source: Select a credit card.
ar_ae: حدد بطاقة الائتمان

# LabelSelectDepositType
source: Please choose the type of deposit.
ar_ae: الرجاء اختيار نوع الحساب

# LabelSelectInquiry
source: Please choose the type of inquiry.
ar_ae: الرجاء تحديد طبيعة الإستفسار

# LabelSelectLoanAccount
source: Select Loan Account
ar_ae: حدد حساب القرض

# LabelSelectLoanAccountWatermark
source: Select a loan account.
ar_ae: حدد حساب القرض

# LabelSelectService
source: Select a service.
ar_ae: قم باختيار الخدمة

# LabelSelectServices
source: Select Services
ar_ae: قم باختيار الخدمات

# LabelSelectTransactionType
source: Please choose the type of transaction.
ar_ae: يرجى اختيار نوع المعاملة

# LabelSenderMobile
source: Sender Mobile
ar_ae: رقم الهاتف المتحرك للمرسل

# LabelSenderMobileColon
source: Sender Mobile:
ar_ae: رقم الهاتف المتحرك للمرسل

# LabelSewa
source: SEWA
ar_ae: هيئة كهرباء ومياه الشارقة

# LabelSewaConsumerNumber
source: SEWA Consumer Number
ar_ae: رقم المستهلك لدى هيئة الكهرباء والمياه في الشارقة

# LabelSewaConsumerNumberColon
source: SEWA Consumer Number:
ar_ae: رقم المستهلك لدى هيئة الكهرباء والمياه في الشارقة

# LabelSignOnSignaturePad
source: Please sign on the signature pad.
ar_ae: يرجى التوقيع في لوحة التوقيع

# LabelSourceAccount
source: From Account
ar_ae: من حساب

# LabelSourceAccountColon
source: From Account:
ar_ae: من حساب

# LabelSourceAccountCurrencyColon
source: From Account Currency:
ar_ae: عملة الحساب "من"

# LabelSourceAccountTypeColon
source: From Account Type:
ar_ae: نوع الحساب "من"

# LabelSpecimenSignature1
source: Specimen Signature
ar_ae: نموذج التوقيع 1

# LabelSpecimenSignature2
source: Specimen Signature 2
ar_ae: نموذج التوقيع 2

# LabelThankYou
source: Thank you for using Al Rajhi bank services
ar_ae: شكرا لاستخدامكم خدمات مصرف الراجحي

# LabelTotal
source: Total
ar_ae: الإجمالي

# LabelTotalChequesDepositedColon
source: Total Cheques Deposited:
ar_ae: إجمالي الشيكات المودعة

# LabelTransactionLimit
source: Transaction Limit
ar_ae: حد المعاملات

# LabelTransactionPin
source: Transaction PIN
ar_ae: رقم التعريف الشخصي للمعاملة

# LabelTransactionPinColon
source: Transaction PIN:
ar_ae: رقم التعريف الشخصي للمعاملة

# LabelTransactions
source: transaction(s)
ar_ae: معاملة (معاملات)

# LabelTransactionSuccessful
source: Transaction completed successfully
ar_ae: تم إنجاز العملية بنجاح

# LabelTransferAmountColon
source: Transfer Amount:
ar_ae: مبلغ التحويل

# LabelTransferInformation
source: Please note that the exchange rates are indicative. Minimum amount for executing account transfer to be one unit of respective currency.
ar_ae: يرجى ملاحظة أن أسعار الصرف هي للإرشاد فقط. حيث يكون الحد الأدنى للمبلغ اللازم لتنفيذ حوالة الحساب هو وحدة واحدة من العملة المعنية

# LabelTransferredAmount
source: Transferred Amount
ar_ae: مبلغ التحويل

# LabelTransferredAmountColon
source: Transferred Amount:
ar_ae: مبلغ التحويل

# LabelTypeOfAccount
source: Type of Account
ar_ae: نوع الحساب

# LabelUnClearedAmountColon
source: Uncleared Amount:
ar_ae: المبلغ الذي لم تتم تسويته

# LabelValueDate
source: Value Date
ar_ae: تاريخ القيمة

# LabelWelcomeTallerAssistance
source: Welcome to Al Rajhi Bank Online Video Assistance
ar_ae: نرحب بكم في الخدمة المباشرة عبر تقنية الإتصال من خلال الفيديو من مصرف الراجحي

# LabelWithdrawalAmountColon
source: Withdrawal Amount:
ar_ae: مبلغ السحب

# MessageCallEnded
source: Call ended.
ar_ae: انتهى الاتصال

# MessageCallingForAssistance
source: You will be connected to our service representative shortly through the video conference system. For your privacy, use the designated handset to your left.
ar_ae: جاري الإتصال بمندوب الخدمة لدينا من خلال تقنية الإتصال عبر الفيديو لحماية خصوصيتك، استخدم سماعة الهاتف و المثبتة على يسارك

# MessageCancelledDepositTransaction
source: Transaction cancelled. Please collect your cash.
ar_ae: لقد تم إلغاء المعاملة، الرجاء سحب النقد الخاص بكم

# MessageChequesProcessing
source: Please wait. Your cheques are being processed.
ar_ae: الرجاء الإنتظار لحين معالجة الشيكات الخاصة بك

# MessageCollectCheques
source: Please collect your cheque(s).
ar_ae: يرجى سحب الشيكات الخاصة بك.

# MessageCollectRemainingCheques
source: Please collect your remaining cheque(s).
ar_ae: يرجى سحب الشيكات المتبقية الخاصة بك.

# MessageInsertCard
source: Please insert your card.
ar_ae: يرجى إدخال بطاقتك

# MessageInsertCash
source: Please insert cash. The minimum currency denomination accepted is SAR 5 for deposit
ar_ae: الرجاء ايداع النقود، أقل ورقة نقدية يمكن إيداعها هي من فئة 5 ﷼‎

# MessageInsertCashMax
source: Please insert cash (maximum 40,000 SAR). The minimum deposit denomination is 5 SAR.
ar_ae: يرجى إدخال النقود (الحد الأقصى 40000 ﷼)الحد الأدنى للإيداع هو 5 ﷼

# MessageInsertCheque
source: Please insert cheque.
ar_ae: يرجى إدخال الشيك

# MessageInsertEmiratesId
source: Please insert your Emirates ID card.
ar_ae: يرجى إدخال بطاقة الهوية الإماراتية

# MessageNotEligibleTransaction
source: Dear Customer, You are not eligible to execute this transaction.
ar_ae: عميلنا العزيز، لا يمكن لك تنفيذ هذه العملية

# MessageNoTellerAvailable
source: We are currently busy serving other customers, please hold and we will be assisting you shortly.
ar_ae: إننا نقوم بخدمة عملاء آخرين في الوقت الحالي، الرجاء الإنتظار و سنقوم بخدمتك قريبا

# MessageNotifyActivatedAccount
source: We will notify you once your new account is activated. Thank you.
ar_ae: سنقوم بإشعارك ما أن يتم تفعيل حسابك الجديد شكراً لك

# MessagePrintingReceipt
source: Printing your receipt...
ar_ae: طباعة الإيصال الخاص بك

# MessagePrintingStatement
source: Printing your statement...
ar_ae: جاري طباعة كشف حسابك

# MessageRetractingCard
source: We are sorry for inconveience, this card is captured by the machine, please contact the branch.
ar_ae: نعتذر لسحب البطاقة عن طريق الجهاز، الرجاء الإتصال بالفرع

# MessageRetractingCash
source: We are sorry for inconveience, these cash notes is held by the machine, please contact the branch.
ar_ae: نعتذر لحجز المبلغ عن طريق الجهاز، الرجاء الإتصال بالفرع

# MessageRetractingCheques
source: We are sorry for inconveience, Cheque(s) is held by the machine, please contact the branch.
ar_ae: نعتذر لحجز الشيك (الشيكات) عن طريق الجهاز، الرجاء الإتصال بالفرع

# MessageRetractingEmiratesId
source: We are sorry for inconveience, this Emirates ID card is captured by the machine, please contact the branch.
ar_ae: نعتذر لسحب بطاقة الهوية الإمراتية عن طريق الجهاز، الرجاء الإتصال بالفرع

# MessageSuccessfulRequest
source: Request is submitted successfully.
ar_ae: تم إرسال الطلب بنجاح

# MessageTakeCard
source: Please take your card, thank you for using Al Rajhi bank services.
ar_ae: الرجاء القيام بسحب بطاقتك

# MessageTakeCash
source: Please collect your cash.
ar_ae: الرجاء جمع النقد الخاص بك

# MessageTakeEmiratesId
source: Please take your Emirates ID card.
ar_ae: الرجاء سحب بطاقة الهوية الإماراتية الخاصة بك

# MessageTakeReceipt
source: Please collect your receipt.
ar_ae: الرجاء تحصيل الإيصال الخاص بك

# MessageUsingATMNetwork
source: Thank you for using the UAE Switch ATM Network
ar_ae: شكرًا لاستخدامك خدمات صراف الإمارات الآلي

# MessageWait
source: Please wait…
ar_ae: الرجاء الإنتظار

# QuestionPerformTransaction
source: Do you want to perform another transaction?
ar_ae: هل ترغب في إجراء معاملة أخرى

# QuestionProceedWithoutReceipt
source: Receipt Printing is currently not working. Do you want to proceed to the transaction without receipt printing?
ar_ae: لا يمكن طباعة الإيصال حالياً.هل تريد إتمام معاملتك بدون طبع الإيصال؟

# QuestionRetard
source: Do you need more time ?
ar_ae: هل أنت بحاجة لمزيد من الوقت؟

# ValidationAccountCurrencyRequired
source: The account currency is not specified.
ar_ae: لم يتم تحديد عملة الحساب

# ValidationAccountIbanLength
source: Length must be 16.
ar_ae: يجب أن يكون الطول 16

# ValidationAccountNumberMinLength
source: Minimum 16 digits should be entered.
ar_ae: يجب إدخال 16 رقم كحد أقصى

# ValidationAccountNumberRequired
source: The account number is not specified.
ar_ae: لم يتم تحديد رقم الحساب

# ValidationAccountTypeCodeRequired
source: The account type code is not specified.
ar_ae: لم يتم تحديد رمز نوع الحساب

# ValidationAmountMultiples100
source: The amount must be in multiples of 100.
ar_ae: يجب أن يكون المبلغ من مضاعافات 100

# ValidationAmountMultiplesFormat
source: The amount must be in multiples of {0}.
ar_ae: يجب أن يكون المبلغ من مضاعافات {0}

# ValidationBeneficiaryIdLength
source: Length must be 5.
ar_ae: يجب أن يكون الطول 5

# ValidationCommentsLength
source: Length must be between 3 and 100.
ar_ae: يجب أن يكون الطول بين 3 و 100

# ValidationCompanyNameLingth
source: Length must be between 3 and 50.
ar_ae: يجب أن يكون الطول بين 2 و 50

# ValidationConsumerNumberMinLength
source: Minimum 10 digits should be entered.
ar_ae: يجب إدخال 10 رقم كحد أقصى

# ValidationCreditCardNumberRequired
source: The credit card number is not specified.
ar_ae: لم يتم تحديد رقم البطاقة الائتمانية

# ValidationDateMustBeLaterThanToday
source: The date must be later than today.
ar_ae: يجب أن يكون التاريخ لاحق لتاريخ اليوم

# ValidationEnterNewValue
source: Enter new value.
ar_ae: ادخل القيمة الجديدة

# ValidationEqualAccounts
source: Source and destination accounts cannot be the same.
ar_ae: لا يمكن أن يكون حساب المصدر هو نفسه حساب المستلم

# ValidationFundSourceRequired
source: Please state a source of fund.
ar_ae: الرجاء توضيح مصدر التمويل

# ValidationInsufficientBalance
source: Insufficient balance in the account.
ar_ae: عدم توافر الرصيد الكافي في الحساب

# ValidationInsufficientCreditCardBalance
source: Insufficient balance in the credit card.
ar_ae: لا يوجد رصيد كاف بالبطاقة الائتمانية.

# ValidationInvalidEmailAddress
source: Invalid email address.
ar_ae: عنوان البريد الإلكتروني غير صحيح

# ValidationInvalidEmiratesId
source: Invalid Emirates ID.
ar_ae: بطاقة الهوية الإماراتية غير صالحة

# ValidationInvalidOtp
source: Only 6 digits are allowed.
ar_ae: يسمح بوجود 6 خانات فقط

# ValidationInvalidPin
source: Invalid PIN. Please try again.
ar_ae: رقم التعريف الشخصي غير صحيح يرجى المحاولة مرة أخرى

# ValidationInvalidPoBoxNo
source: Invalid P.O. Box No.
ar_ae: رقم صندوق بريد غير صالح

# ValidationMaxRechargedAmountFormat
source: Maximum recharge allowed is AED {0}.
ar_ae: الحد الأعلى لإعادة الشحن هو {0} درهم

# ValidationMinAge
source: Minimum age requirement is 18 years.
ar_ae: الحد الأدنى لمتطلبات العمر هو 18 سنة

# ValidationMinRechargedAmountFormat
source: Minimum recharge allowed is AED {0}.
ar_ae: الحد الأدنى لإعادة الشحن هو {0} درهم

# ValidationMobileNumberLength
source: Please enter a valid UAE mobile number.
ar_ae: الرجاء ادخال رقم هاتف متحرك اماراتي صحيح

# ValidationMobileStartWith
source: Mobile number should start with 05.
ar_ae: يجب أن يبدأ رقم الهاتف برقم 05

# ValidationNameLength
source: Length must be between 2 and 35.
ar_ae: يجب أن يكون الطول بين 2 و 35

# ValidationPartialPayment
source: Partial payment is not allowed.
ar_ae: لا يسمح بالدفع الجزئي

# ValidationPhoneLength
source: Length must be between 9 and 15.
ar_ae: يجب أن يكون الطول بين 9 و 15

# ValidationRequired
source: Required
ar_ae: مطلوب

# ValidationSalaryLength
source: Length must be between 3 and 10.
ar_ae: يجب أن يكون الطول بين 3 و 10

# ValidationSalikPinLength
source: Length must be 4.
ar_ae: يجب أن يكون الطول 4

# ValidationTransactionPinLength
source: Transaction PIN length must be 8 digits.
ar_ae: يجب أن يتكون رقم التعريف الشخصي للمعاملة من ٨ أرقام.

# ValidationWealthTypeRequired
source: Please select a wealth type.
ar_ae: يرجى اختيار نوع برنامج الثراء

# ValidationZeroAmount
source: The amount must be greater than zero.
ar_ae: ينبغي أن يكون المبلغ أكبر من صفر

# LabelEnterCif
source: Please enter your 7 digits accounts number
ar_ae: أدخل رقم الحساب المكون من 7 أرقام ثم اضغط على إرسال كلمة مرور لمرة واحدة

# LabelEnterCifArabic
source: الرجاء ادخال رقم الحساب المكون من 7 أرقام
ar_ae: الرجاء إدخال سيف الخاص بك

# ValidationInvalidCif
source: The 7 digits account number is invalid, please try again
ar_ae: إن رقم الحساب المكون من 7 أرقا غير صحيح، الرجاء المحاولة مرة أخرى

# ButtonDocuments
source: Documents
ar_ae: مستندات

# ButtonAHBChequeDeposit
source: Instant Al Rajhi Cheque Deposit / Encashment
ar_ae: صرف / إيداع شيك الراجحي بشكل فوري

# ButtonAHBChequePrinting
source: Instant Cheque Printing
ar_ae: طباعة شيك بشكل فوري

# ButtonBankingServices
source: Banking Services
ar_ae: الخدمات المصرفية

# ButtonProductInfo
source: Products
ar_ae: المنتجات

# ButtonCardlessDeposit
source: Cardless Deposits
ar_ae: إيداع بدون البطاقة

# ErrorAuthenticationFailed
source: Authentication failed, please try again later.
ar_ae: إن المعلومات المدخلة غير صحيحة، الرجاء المحاولة مرة أخرى

# LabelLast5Transactions
source: Last 5 Transactions
ar_ae: آخر 5 معاملات

# MessagePrintingCheque
source: Printing your cheque(s)...
ar_ae: جار طباعة الشيكات

# ErrorA4PrinterNotAvailable
source: This service is currently unavailable, please visit the other Al Rajhi bank machines or the branch
ar_ae: هذه الخدمة غير متوفرة في الوقت الحالي، يرجى زيارة أحد اجهزة مصرف الراجحي الأخرى أو تفضل بزيارة الفرع

# ErrorA4PrinterPaperJam
source: This service is currently unavailable, please visit the other Al Rajhi bank machines or the branch
ar_ae: هذه الخدمة غير متوفرة في الوقت الحالي، يرجى زيارة أحد اجهزة مصرف الراجحي الأخرى أو تفضل بزيارة الفرع

# LabelChargesColon
source: Charges:
ar_ae: الرسوم

# LabelNumberOfChequesColon
source: Number Of Cheque Leaves:
ar_ae: عدد أوراق الشيكات

# LabelStatementPeriod
source: Please select statement period and press Continue
ar_ae: يرحى اختيار الفترة المطلوبة ( لكشف الحساب ) واضغط على استمرار

# ButtonLC
source: Certificate of Liability
ar_ae: شهادة مديونية

# ButtonIBAN
source: IBAN Letter
ar_ae: IBAN رسالة رقم الحساب الدولي

# ButtonNLC
source: Certificate of Non-Liability
ar_ae: شهادة براءة الذمة

# AccountStatusLabel
source: Account Status
ar_ae: حالة الحساب

# BranchIDLabel
source: Branch ID
ar_ae: رمز الفرع

# IBANCopyMessage
source: If you require a personal copy,please select one of the two options below
ar_ae: إذا كنت تريد الحصول على رقم الحساب الدولي من خلال هاتفك المتحرك أو البريد الإلكتروني، يرجى تحديد أحد الخيارين أدناه

# PrintButton
source: Print
ar_ae: طباعة

# ProceedButton
source: Continue
ar_ae: استمرار

# AuthenticatewithCIF
source: Enter your 7 digits account number
ar_ae: أدخل رقم حسابك المكون من 7 أرقام

# AcceptLabel
source: I Accept
ar_ae: أوافق

# BankRepresetativeLabel
source: Our represetative will contact you within 2 working days.
ar_ae: سيقوم ممثل المصرف بالاتصال بك خلال يومي عمل

# MrMrsLabel
source: Dear Mr./Mrs.
ar_ae: عزيزي السيد / السيدة.

# ReferenceNumberLabel
source: Your reference number is
ar_ae: رقمك المرجعي هو

# LabelSendToMyMobile
source: If you need to receive this reference number via email or sms, please select one of the below options or click "Continue" to proceed
ar_ae: إذا أردت الحصول على الرقم المرجعي لهذه العملية من خلال البريد الإلكتروني أو خدمة الرسائل النصية الرجاء الإختيار ادناه أو اضغط استمرار

# ButtonSendToMyMobile
source: Send To My Mobile
ar_ae: أرسل إلى هاتفي المتحرك

# TermsConditionMsg1
source: This request will initiate a backend process and the concerened AHB representative will contact you to continue this process.
ar_ae: سوف یبدأ ھذا الطلب في عملیة الخلفیة وسوف یتصل بك ممثل أهب المرسل إلیك لمواصلة ھذه العملیة.

# TermsConditionMsg2
source: Please click Continue to start the process and generate a reference number.
ar_ae: الرجاء النقر فوق متابعة لبدء العملية وإنشاء رقم مرجعي.

# LabelServiceRequest
source: Certificates/Letter Requests
ar_ae: طلب الشهادات و الرسائل

# ButtonContinue
source: Continue
ar_ae: استمرار

# ButtonNonAHBChequeDeposit
source: Non Rajhi Bank Cheque Deposit
ar_ae: إيداع شيك من مصرف آخر

# ButtonSendOtp
source: Send one time password
ar_ae: إرسال "كلمة مرور لمرة واحدة"

# ButtonValidate
source: Continue
ar_ae: استمرار

# LabelChoseLanguage
source: Please choose the language
ar_ae: Please choose your language

# LabelInsertCard
source: Insert your bank or Emirates ID card
ar_ae: ادخل البطاقة المصرفية او بطاقة الهوية الإمراتية

# LabelOnlineAssistance
source: Online Assistance
ar_ae: مساعدة مباشرة

# LabelOR
source: OR
ar_ae: أو

# LabelSelectOrEnterAmount
source: Please select the amount from the available below or enter the required amount and press Continue
ar_ae: الرجاء اختيار المبلغ المراد سحبة من الخيارات ادناه او ادخل المبلغ المراد و اضغط استمرار

# ButtonSendRequest
source: Send Request
ar_ae: ارسل طلب

# LabelAmountCalculated
source: Amount Calculated
ar_ae: المبلغ الذي تم تحديده حتى الآن

# LabelDoAnotherTransaction
source: Would you like to do any other transaction?
ar_ae: هلى ترغب بإنجاز معاملات أخرى؟

# LabelTransactionCompleted
source: This transaction is completed.
ar_ae: لقد تم إنجاز العملية بنجاح

# ErrorInvalidCheque
source: Inserted cheque is not valid
ar_ae: إن الشيك المودع غير صالح

# LabelChequeConfirmation
source: Please review the cheque and related information and press Continue to proceed.
ar_ae: الرجاء مراجعة تفاصيل الشيك و المعلومات المدخلة ثم اضغط على أستمرار للمتابعة

# LabelChequeProcessingDays
source: Please note it may take 3 business days to process this request.
ar_ae: الرجاء ملاحظة انه سيتم تحصيل الشيك خلال فترة ثلاثة أيام عمل من تاريخه.

# LabelEnterChequeAmount
source: Enter Cheque Amount
ar_ae: أدخل مبلغ الشيك

# MessagePrintingIBAN
source: Printing your Iban letter...
ar_ae: جاري طباعة رسالة رقم الحساب الدولي (IBAN)

# ValidationInvalidMobileNo
source: Invalid Mobile Number.
ar_ae: رقم الجوال غير صالح

# ButtonAccept
source: Accept
ar_ae: أوافق

# ButtonReject
source: Reject
ar_ae: لا أوافق

# LabelCallConfirmation
source: Dear Customer, you will be connected to Al Rajhi representative through the video conference system to perform this transaction, The video session is recorded for quality and training purposes,. To continue please accept
ar_ae: عميلنا العزيز، سوف يتم اجراء المعاملة من خلال تقنية المحادثة عبر الفيديو مع الموظف المسؤول من مصرف الراجحي و سوف يتم تسجيل المحادثة من خلال الفيديو لأغراض الجودة و التدريب للإستمرار يرجى اختيار موافق

# LabelChoseLanguageArabic
source: الرجاء اختيار اللغة
ar_ae: يرجى اختيار اللغة

# LabelPrimaryAccountNumberColon
source: Primary Account Number:
ar_ae: رقم الحساب الرئيسي

# ErrorNoTellerAvailable
source: We are currently busy serving other customers, please hold and we will be assisting you shortly
ar_ae: إننا نقوم بخدمة عملاء آخرين في الوقت الحالي، الرجاء الإنتظار و سنقوم بخدمتك قريبا

# LabelEndDate
source: End Date:
ar_ae: تاريخ الانتهاء

# LabelStartDate
source: Start Date:
ar_ae: تاريخ البدء

# ButtonSendToMyEmail
source: Send To My Email
ar_ae: إرسال إلى بريدي الإلكتروني

# LabelLast1Month
source: Last 1 Month
ar_ae: آخر شهر

# LabelLast2Month
source: Last 2 Months
ar_ae: آخر شهرين

# LabelLast3Month
source: Last 3 Months
ar_ae: آخر ثلاثة أشهر

# LabelLast6Month
source: Last 6 Months
ar_ae: آخر ستة أشهر

# LabelCheque
source: Cheque
ar_ae: الشيك

# LabelCheques
source: Cheques
ar_ae: الشيكات

# ButtonPrintStatement
source: Print Statement
ar_ae: طباعة كشف الحساب

# ButtonSelectCard
source: Select Card
ar_ae: حدد البطاقة

# LabelCallHold
source: Please wait while we process your request.
ar_ae: الرجاء الانتظار بينما نقوم بمعالجة طلبك

# MessageTakeCoins
source: Collect your coins
ar_ae: قم بسحب القطع النقدية

# MessageTakeCashEncashment
source: Collect your cash now and coins will follow
ar_ae: قم بسحب النقود الآن متبوعة بالقطع النقدية

# MessageCollectIBAN
source: Please collect your IBAN letter from the printer tray.
ar_ae: الرجاء استلام رسالة رقم الحساب الدولي (IBAN) من المكان المخصص

# MessageCollectStatement
source: Please collect your statement from the printer tray.
ar_ae: يرجى استلام كشف الحساب من المكان المخصص

# ErrorInvalidDate
source: Please note that the deposited cheque date should not exceed the last 6 months to be processed on this machine.
ar_ae: الرجاء ملاحظة أن تاريخ الشيك يجب أن لا يتعدى الستة أشهر الماضية لإيداعه من خلال هذا الجهاز

# ErrorNotAvailableService
source: This service is currently unavailable, please visit the other Al Rajhi bank machines or the branch.
ar_ae: هذه الخدمة غير متوفرة في الوقت الحالي، يرجى زيارة أحد اجهزة مصرف الراجحي الأخرى أو تفضل بزيارة الفرع

# LabelCanDispenseCoins
source: The amount will be dispensed based on the available denominations and remaining change will be dispensed as coins. Please press "Yes" for coins or "No" to credit the remaining change to your account
ar_ae: سيتم صرف المبلغ وسيتم استبدال الباقي كقطع نقدية. يرجى الضغط على "نعم" للمتابعة و استلام القطع النقدية أو "لا" لإيداع الباقي في حسابك

# LabelCannotDispenseCoins
source: The amount will be dispensed based on the available denominations but the remaining change will be credited to your account
ar_ae: سيتم صرف المبلغ ولكن سيتم إيداع الباقي في حسابك

# ErrorGenericUnavailableService
source: This service is currently unavailable, please visit the other Al Rajhi bank machines or the branch.
ar_ae: هذه الخدمة غير متوفرة في الوقت الحالي، يرجى زيارة أحد اجهزة مصرف الراجحي الأخرى أو تفضل بزيارة الفرع

# ErrorNoCheques
source: Transaction Cancelled
ar_ae: تم إلغاء المعاملة

# ErrorNoTellerLoggedIn
source: Our working hours are from (8:00 AM to 10:00 PM) Saturday to Thursday. You can always perform your transactions through this machine or through online or mobile banking For more information, please call 600599992
ar_ae: إن ساعات العمل هي من (8 صباحا و حتى 10) مساءً من السبت إلى الخميس. تستطيع القيام بمعاملاتك المصرفية من خلال هذا الجهاز أو من خلال خدمات الراجحي عبر الإنترنت و تطبيقات الهاتف المتحرك. لمزيد من المعلومات، الرجاء الإتصال على 600599992
