Repository: TalatMasud-OmniaPayments/BDM
Catalog: BDM-ALRAJHI/Omnia.Pie.Bdm/Omnia.Pie.Bdm.Bootstrapper/Properties/Resources.*.resx
Languages: ar_ae

# Button1000Aed
source: 1000 AED
ar_ae: 1000 درهم

# Button100Aed
source: 100 AED
ar_ae: 100 درهم

# Button200Aed
source: 200 AED
ar_ae: 200 درهم

# Button500Aed
source: 500 AED
ar_ae: 500 درهم

# ButtonAccountInquiry
source: Account Inquiry
ar_ae: الاستعلام عن الحساب

# ButtonAddBeneficiary
source: Add Beneficiary
ar_ae: أضف مستفيد

# ButtonAddMore
source: Add More
ar_ae: إيداع المزيد

# ButtonApprove
source: Continue
ar_ae: استمرار

# ButtonBack
source: Back
ar_ae: رجوع

# ButtonBalanceInquiry
source: Balance Inquiry
ar_ae: الإستعلام عن الرصيد

# ButtonBillPayment
source: Bill Payment
ar_ae: دفعة الفاتورة

# ButtonCallForAssistance
source: Online Assistance
ar_ae: مساعدة مباشرة

# ButtonCancel
source: Cancel
ar_ae: إلغاء

# ButtonCardlessCashWithdrawal
source: Cardless Cash Withdrawal
ar_ae: السحب النقدي بدون بطاقة

# ButtonCardTransactions
source: Card Transactions
ar_ae: عمليات البطاقة الإئتمانية

# ButtonCashDeposit
source: Cash Deposit
ar_ae: الإيداع النقدي

# ButtonCashDepositToAccount
source: Cash Deposit to Account
ar_ae: الإيداع النقدي لحساب

# ButtonCashDepositToCreditCard
source: Cash Deposit to Credit Card
ar_ae: الإيداع النقدي لبطاقة الإئتمان

# ButtonCashWithdrawal
source: Cash Withdrawal
ar_ae: السحب النقدي

# ButtonChequeBookRequest
source: Cheque Book Request
ar_ae: طلب دفتر شيكات

# ButtonChequeDeposit
source: Cheque Deposit
ar_ae: إيداع الشيك

# ButtonChequeDepositToAccount
source: Cheque Deposit to Account
ar_ae: إيداع الشيك إلى الحساب

# ButtonChequeDepositToCreditCard
source: Cheque Deposit to Credit Card
ar_ae: إيداع شيك إلى بطاقة الائتمان

# ButtonConfirm
source: Continue
ar_ae: استمرار

# ButtonCreditCardPayment
source: Credit Card Payment
ar_ae: الدفع لبطاقة الإئتمان

# ButtonCreditCardPayments
source: Credit Card Payments
ar_ae: دفعات بطاقات الائتمان

# ButtonCustomerDetailsUpdate
source: Customer Details Update
ar_ae: تحديث تفاصيل العملاء

# ButtonDepositTransactionsCardless
source: Cardless Deposit Transactions
ar_ae: معاملات الإيداع بدون بطاقة

# ButtonELife
source: eLife (Landline + Data)
ar_ae: اي لايف

# ButtonEnter
source: Enter
ar_ae: أدخل

# ButtonEnterAccountNumber
source: Enter Account Number
ar_ae: ادخل رقم الحساب يدويًا

# ButtonEnterCardNumber
source: Enter your 16 Digits card number
ar_ae: أدخل رقم البطاقة المكون من 16 رقم

# ButtonFundsTransfer
source: Funds Transfer
ar_ae: تحويل الأموال

# ButtonFundsTransferOtherAccounts
source: Transfer Between Other AHB Accounts
ar_ae: التحويل بين حسابات بنك الراجحي الأخرى

# ButtonFundsTransferOwnAccounts
source: Transfer Between Own Accounts
ar_ae: التحويل بين الحسابات الخاصة

# ButtonGoGreen
source: Go Green
ar_ae: لا تطبع الإيصال

# ButtonLast6MonthsStatement
source: Last 6 Months Statement
ar_ae: كشف حساب عن الستة أشهر الماضية

# ButtonLoanInquiry
source: Loan Inquiry
ar_ae: الاستعلام عن القرض

# ButtonLoanSchedule
source: Loan Schedule
ar_ae: جدول القرض

# ButtonMinistatement
source: Ministatement
ar_ae: بيان مؤقت

# ButtonMinistatementInquiry
source: Ministatement Inquiry
ar_ae: الاستفسار عن الكشف المصغر

# ButtonNext
source: Next
ar_ae: التالى

# ButtonNo
source: No
ar_ae: لا

# ButtonNoThanks
source: No, thank you
ar_ae: لا, شكرا

# ButtonOK
source: OK
ar_ae: موافق

# ButtonOtherAmount
source: Other Amount
ar_ae: مبلغ آخر

# ButtonOtherTransactions
source: Submit Request LC
ar_ae: تعاملات أخرى

# ButtonPostpaid
source: Postpaid
ar_ae: آجل الدفع

# ButtonPostpaidGsm
source: Postpaid (GSM)
ar_ae: آجل الدفع (GSM)

# ButtonPrintPreview
source: Print Preview
ar_ae: معاينة الطباعة

# ButtonPrintReceipt
source: Print Receipt
ar_ae: طباعة الإيصال

# ButtonProceed
source: Continue
ar_ae: استمرار

# ButtonRecharge
source: Recharge
ar_ae: إعادة شحن

# ButtonSelfService
source: Self Service
ar_ae: الخدمة الذاتية

# ButtonSubmit
source: Send
ar_ae: إرسال

# ButtonTelcoBillPayment
source: Telco Bill Payment
ar_ae: سداد فواتير تيلكو

# ButtonUpdate
source: Update
ar_ae: تحديث

# ButtonUpdateAddress
source: Update Address
ar_ae: عنوان التحديث

# ButtonUpdateEmail
source: Update Email Address
ar_ae: عنوان البريد الإلكتروني الجديد

# ButtonUpdateEmiratesId
source: Update Emirates ID
ar_ae: تحديث الهوية الإماراتية

# ButtonUpdateMobileNumber
source: Update Mobile Number
ar_ae: تحديث رقم الجوال

# ButtonUtilityBillPayment
source: Utility Bill Payment
ar_ae: دفعات الفواتير

# ButtonWaselRecharge
source: Wasel Recharge
ar_ae: إعادة شحن واصل

# ButtonYes
source: Yes
ar_ae: نعم

# ErrorAlreadyRequestedChequeBook
source: The cheque book is already requested.
ar_ae: تم طلب إصدار دفتر شيكات بالفعل

# ErrorBeneficiaryAlreadyExists
source: Beneficiary ID already exists. Please enter a new beneficiary ID.
ar_ae: هوية المستفيد موجودة بالفعل، يرجى إدخال هوية مستفيد جديد

# ErrorBlockedCard
source: Card is not valid, please take your card
ar_ae: البطاقة غير صالحة، يرجى سحب البطاقة

# ErrorCapturedCard
source: Your card has been captured. Please contact the bank.
ar_ae: لقد تم حجز البطاقة، الرجاء التواصل مع المصرف

# ErrorCardlessTransactionDeclined
source: Your transaction is declined. Please contact the sender.
ar_ae: معاملة غير صحيحة يرجى الاتصال بالمرسل

# ErrorChequeScanner
source: This service is currently unavailable, please visit the other Al Rajhi bank machines or the branch
ar_ae: هذه الخدمة غير متوفرة في الوقت الحالي، يرجى زيارة أحد اجهزة مصرف الراجحي الأخرى أو تفضل بزيارة الفرع

# ErrorCollectCash
source: Please collect your cash. The minimum currency denomination accepted is SAR 5 for deposit.
ar_ae: يرجى سحب النقد. أقل ورقة نقدية يمكن إيداعها هي من فئة عشرة دراهم

# ErrorDeclinedCashDeposit
source: Cash deposit is declined.
ar_ae: تم رفض الإيداع النقدي

# ErrorDeclinedChequeBook
source: Your cheque book request has been declined. Please try later.
ar_ae: لا يمكن إتمام طلبك الآن، الرجاء زيارة الفرع

# ErrorDeclinedChequeBookContact
source: Your cheque book request has been declined. Please contact branch or contact centre.
ar_ae: لا يمكن إتمام طلبك الآن، الرجاء زيارة الفرع

# ErrorExceededAmount
source: Amount cannot exceed the maximum transfer limit.
ar_ae: لا يمكن أن يتجاوز المبلغ الحد الأقصى للتحويل

# ErrorExceededDailyWithdrawalLimit
source: You have exceeded your daily withdrawal limit.
ar_ae: لقد تجاوزت حد السحب اليومي الخاص بك

# ErrorExceededDepositLimit
source: You have exceeded the maximum deposit limit. Please take your cash back.
ar_ae: لقد تجاوزت حد السحب الخاص بك. يرجى استرجاع النقود الخاصة بك

# ErrorExceededOtp
source: The one time password entered is invalid and needs to be resent.
ar_ae: كلمة المرور التي تستخدم لمرة واحدة التي ادخلتها غير صحيحة ويجب إعادة تعيينها

# ErrorExceededPin
source: You have exceeded your daily pin attempts. SMS sent to your mobile on how to reset your PIN. Please take your card.
ar_ae: لقد تجاوزت محاولاتك اليومية لإدخال رقم التعريف الشخصي. سيتم إرسال رسالة نصية إلى هاتفك المحمول حول كيفية إعادة تعيين رقم التعريف الشخصي الخاص بك. يرجى أخذ البطاقة

# ErrorExceededWithdrawalLimit
source: You have exceeded the transaction withdrawal limit.
ar_ae: لقد تجاوزت حد المعاملة السحب الخاص بك

# ErrorExceededWithdrawalFrequencyLimit
source: You have exceeded the withdrawal frequency limit.
ar_ae: لقد تجاوزت حد تكرر السحب الخاص بك

# ErrorExpiredCard
source: Your card has expired.
ar_ae: لقد انتهت صلاحية البطاقة الخاصة بك

# ErrorExpiredEmiratesId
source: Your ID card has expired.
ar_ae: انتهت صلاحية بطاقة الهوية الخاصة بك

# ErrorExpiredOtp
source: The one time password sent to you has been expired and needs to be resent.
ar_ae: انتهت فترة صلاحية كلمة المرور لمرة واحدة ويجب إعادة إرسالها

# ErrorFailedRequest
source: This service is currently unavailable, please visit the other Al Rajhi bank machines or the branch
ar_ae: هذه الخدمة غير متوفرة في الوقت الحالي، يرجى زيارة أحد اجهزة مصرف الراجحي الأخرى أو تفضل بزيارة الفرع

# ErrorIncorrectAmount
source: The entered amount is incorrect. Please re-enter amount in multiple of 100.
ar_ae: المبلغ الذي تم إدخاله غير صحيح، يرجى إعادة إدخال المبلغ بمضاعفة العدد 100

# ErrorInsufficientBalance
source: The account balance is insufficient to complete the transaction
ar_ae: إن الرصيد المتوفر في الحساب غير كاف لإتمام المعاملة.

# ErrorInvalidAccount
source: The account is not correct.
ar_ae: إن الحساب غير صحيح

# ErrorInvalidLogin
source: The username or password is incorrect.
ar_ae: خطأ في اسم المستخدم أو كلمة السر

# ErrorInvalidAccountNumber
source: Invalid account number. Please try again.
ar_ae: رقم الحساب غير صحيح يرجى المحاولة مرة أخرى

# ErrorInvalidBeneficiaryAccount
source: Please enter a valid beneficiary account.
ar_ae: يرجى إدخال حساب مستفيد صالح

# ErrorInvalidCardNumber
source: Dear Customer, this Service is currently for Al Rajhi bank’s Cards holders. You can always have information about our recent offers by selecting “Products” from the main page, it’s all about you
ar_ae: عميلنا العزيز، إن هذه الخدمة مخصصة في الوقت الحالي لحاملي بطاقات مصرف الراجحي. لمعرفة المزيد عن أخر عروضنا، الرجاء إختيار "المنتجات" من القائمة الرئيسية، المهم أنت

# ErrorInvalidCreditCard
source: Invalid credit card. Please try a valid credit card.
ar_ae: بطاقة الائتمان غير صالحة يرجى المحاولة ببطاقة ائتمان صالحة

# ErrorInvalidDebitCard
source: Invalid debit card.
ar_ae: بطاقة الخصم غير صالحة يرجى المحاولة ببطاقة خصم صالحة

# ErrorInvalidOtp
source: The one time password entered is invalid. Please try again.
ar_ae: كلمة المرور التي تستخدم لمرة واحدة التي ادخلتها حاول مرة اخرى

# ErrorInvalidPin
source: The PIN is invalid, please try again
ar_ae: رقم التعريف الشخصي غير صحيح يرجى المحاولة مرة أخرى

# ErrorInvalidTransaction
source: Unable to process the transaction. Please try again later.
ar_ae: تعذر إجراء المعاملة. يرجى المحاولة مرة أخرى لاحقًا

# ErrorLeadExists
source: Lead already exists in the system. You will be contacted shortly.
ar_ae: البيانات مسجلة مسبقاً، سيتم الإتصال بك قريباً

# ErrorNotAvailableFunction
source: This service is currently unavailable, please try again later.
ar_ae: هذه الخدمة غير متوفرة في الوقت الحالي، يرجى زيارة أحد اجهزة مصرف الراجحي الأخرى أو تفضل بزيارة الفرع

# ErrorNotHaveRequestedAmount
source: This machine does not have the requested amount at this time. Please enter a lesser amount.
ar_ae: لا يحتوي الجهازعلى المبلغ المطلوب في الوقت الحالي، يرجى إدخال مبلغ أقل

# ErrorNotRegisteredEmiratesId
source: Your Emirates ID is not registered. Please contact the bank.
ar_ae: بطاقة الهوية الإماراتية الخاصة بك غير مسجلة. يرجى الاتصال بالبنك

# ErrorPinTriesLimit
source: Sorry for the inconvenience.You did not enter your correct PIN. Maximum number of retries has been exceeded. Please remove your card.
ar_ae: لم يتم إدخال رقمك السري بالصوره الصحيحه الرجاء سحب البطاقه

# ErrorUnableDeposit
source: Unable to deposit your cash.
ar_ae: تعذر إيداع النقود الخاصة بك

# ErrorUnableDispense
source: Unable to dispense the money. Please try later.
ar_ae: تعذر صرف النقود. يرجى المحاولة لاحقًا

# ErrorUnablePrintReceipt
source: Unable to print the receipt. Please try again later.
ar_ae: لا يمكن طباعة الإيصال. يرجى إعادة المحاولة في وقت لاحق

# ErrorUnableProvideInformation
source: Unable to provide the information. Please try later.
ar_ae: تعذر توفير المعلومات. يرجى المحاولة لاحقًا

# ErrorUnauthorizedUsage
source: Unauthorized usage. Please contact the bank.
ar_ae: استخدام غير مصرح. يرجى الاتصال بالبنك

# LabelAadc
source: AADC
ar_ae: شركة العين للتوزيع

# LabelAadcConsumerNumber
source: AADC Consumer Number
ar_ae: رقم المستهلك لدى العين للتوزيع

# LabelAadcConsumerNumberColon
source: AADC Consumer Number:
ar_ae: رقم المستهلك لدى العين للتوزيع

# LabelAccountCurrency
source: Account Currency
ar_ae: عملة الحساب

# LabelAccountCurrencyColon
source: Account Currency:
ar_ae: عملة الحساب

# LabelAccountNameColon
source: Account Name:
ar_ae: اسم الحساب

# LabelAccountNumberColon
source: Account Number:
ar_ae: رقم الحساب

# LabelAccountType
source: Account Type
ar_ae: نوع الحساب

# LabelAccountTypeColon
source: Account Type:
ar_ae: نوع الحساب

# LabelAddc
source: ADDC
ar_ae: شركة أبوظبي للتوزيع

# LabelAddcConsumerNumber
source: ADDC Consumer Number
ar_ae: رقم المستهلك لدى العين للتوزيع

# LabelAddcConsumerNumberColon
source: ADDC Consumer Number:
ar_ae: رقم المستهلك لدى العين للتوزيع

# LabelAddressUpdated
source: Your address has been updated in your record.
ar_ae: تم تحديث عنوانك في السجل الخاص بك

# LabelAed
source: AED
ar_ae: درهم

# LabelAmount
source: Amount
ar_ae: المبلغ

# LabelAmountColon
source: Amount:
ar_ae: المبلغ

# LabelApplicationType
source: Type of Application
ar_ae: نوع الطلب

# LabelAuthCodeColon
source: Auth Code:
ar_ae: رمز التفويض

# LabelAvailableBalance
source: Available Balance
ar_ae: الرصيد المتاح

# LabelAvailableBalanceColon
source: Available Balance:
ar_ae: الرصيد المتاح

# LabelAvailableCardLimitColon
source: Available Card Limit:
ar_ae: المبلغ المتوفر في البطاقة

# LabelAvailableLimit
source: Available Limit
ar_ae: المبلغ المتوفر في البطاقة

# LabelAvailableLimitColon
source: Available Limit:
ar_ae: المبلغ المتوفر في البطاقة

# LabelBalance
source: Balance
ar_ae: الرصيد

# LabelBalanceColon
source: Balance:
ar_ae: الرصيد

# LabelBeneficiaryAccount
source: Beneficiary Account
ar_ae: حساب المستفيد

# LabelBeneficiaryAccountColon
source: Beneficiary Account:
ar_ae: حساب المستفيد

# LabelBeneficiaryAccountCurrencyColon
source: Beneficiary Account Currency:
ar_ae: عملة حساب المستفيد

# LabelBeneficiaryAccountIbanColon
source: Beneficiary Account / IBAN:
ar_ae: رقم الحساب المصرفي الدولي / رقم حساب المستفيد

# LabelBeneficiaryFirstName
source: Beneficiary First Name
ar_ae: الاسم الأول للمستفيد

# LabelBeneficiaryId
source: Beneficiary ID
ar_ae: هوية المستفيد

# LabelBeneficiaryIdColon
source: Beneficiary ID:
ar_ae: هوية المستفيد

# LabelBeneficiaryLastName
source: Beneficiary Last Name
ar_ae: الاسم الأخير للمستفيد

# LabelBeneficiaryMobile
source: Beneficiary Mobile
ar_ae: رقم الهاتف المتحرك للمستفيد

# LabelBeneficiaryMobileColon
source: Beneficiary Mobile:
ar_ae: رقم الهاتف المتحرك للمستفيد

# LabelBeneficiaryNameColon
source: Beneficiary Name:
ar_ae: اسم المستفيد

# LabelBeneficiaryPhone
source: Beneficiary Phone No
ar_ae: رقم هاتف المستفيد

# LabelBeneficiaryPhoneColon
source: Beneficiary Phone Number:
ar_ae: رقم هاتف المستفيد

# LabelBillAmountDue
source: Bill Amount Due
ar_ae: مبلغ الفاتورة المستحق

# LabelBillAmountDueColon
source: Bill Amount Due:
ar_ae: مبلغ الفاتورة المستحق

# LabelBirthDate
source: Date of Birth
ar_ae: تاريخ الميلاد

# LabelBlockedAmountColon
source: Blocked Amount:
ar_ae: المبلغ المحجوز

# LabelBusiness
source: Business
ar_ae: أعمال تجارية

# LabelCall
source: Call
ar_ae: اتصال

# LabelCardLimitColon
source: Card Limit:
ar_ae: حد البطاقة

# LabelCardNumberColon
source: Card Number:
ar_ae: رقم البطاقة

# LabelCardType
source: Type of Card
ar_ae: نوع البطاقة

# LabelChequeBook
source: Cheque Book
ar_ae: دفتر شيكات

# LabelChooseBillPaymentType
source: Please choose the type of bill payment.
ar_ae: يرجى اختيار نوع دفعة الفاتورة

# LabelChooseTransactionType
source: Please select the required transaction
ar_ae: الرجاء إختيار المعاملة المطلوبة

# LabelChooseUpdateType
source: Please choose the type of update.
ar_ae: يرجى اختيار نوع التحديث

# LabelCompanyName
source: Company Name
ar_ae: اسم الشركة

# LabelConfirmUpdate
source: Please confirm the update
ar_ae: يرجى التأكد من التحديث

# LabelConsumerMobileNumber
source: Consumer Mobile Number
ar_ae: رقم هاتف المستهلك

# LabelConsumerMobileNumberColon
source: Consumer Mobile Number:
ar_ae: رقم هاتف المستهلك

# LabelCountryColon
source: Country:
ar_ae: البلد

# LabelCredit
source: Credit
ar_ae: ائتمان

# LabelCreditCard
source: Credit Card
ar_ae: بطاقة الائتمان

# LabelCreditCardNameColon
source: Credit Card Name:
ar_ae: اسم صاحب البطاقة

# LabelCreditCardNumberColon
source: Credit Card Number:
ar_ae: رقم بطاقة الائتمان

# LabelCreditCardTypeColon
source: Credit Card Type:
ar_ae: نوع بطاقة الائتمان

# LabelCurrency
source: Currency
ar_ae: العملة

# LabelCurrencyAed
source: AED
ar_ae: درهم إماراتي

# LabelCurrencyAud
source: AUD
ar_ae: دولار استرالي

# LabelCurrencyCad
source: CAD
ar_ae: دولار كندي

# LabelCurrencyChf
source: CHF
ar_ae: فرنك سويسري

# LabelCurrencyCodeAed
source: AED
ar_ae: درهم إماراتي

# LabelCurrencyColon
source: Currency:
ar_ae: العملة

# LabelCurrencyEur
source: EUR
ar_ae: يورو

# LabelCurrencyGbp
source: GBP
ar_ae: جنيه بريطاني

# LabelCurrencyUsd
source: USD
ar_ae: دولار أمريكي

# LabelCurrent
source: Current
ar_ae: جاري

# LabelCurrentAccount
source: Current Account
ar_ae: حساب جاري

# LabelCurrentAccountCode
source: Current Account
ar_ae: حساب جاري

# LabelCurrentOutstandingColon
source: Current Outstanding:
ar_ae: الرصيد الحالي المستحق

# LabelCustomerID
source: Customer ID
ar_ae: هوية العميل

# LabelCustomerName
source: Customer Name
ar_ae: اسم العميل

# LabelCustomerNameColon
source: Customer Name:
ar_ae: اسم العميل

# LabelDailyLimit
source: Daily Limit
ar_ae: الحد اليومي

# LabelDebit
source: Debit
ar_ae: دين

# LabelDenomination
source: Denomination Deposited
ar_ae: الفئة المودعة

# LabelDepositedAmountColon
source: Deposited Amount:
ar_ae: المبلغ المودع

# LabelDepositedVolume
source: Volume
ar_ae: حجم المبلغ المودع

# LabelDestinationAccount
source: Destination Account
ar_ae: الحساب المودع له

# LabelDestinationAccountColon
source: Destination Account:
ar_ae: الحساب المودع له

# LabelDestinationAccountCurrencyColon
source: Destination Account Currency:
ar_ae: عملة الحساب المودع له

# LabelDestinationAccountTypeColon
source: Destination Account Type:
ar_ae: نوع الحساب المودع له

# LabelDewa
source: DEWA
ar_ae: هيئة كهرباء ومياه دبي

# LabelDewaConsumerNumber
source: DEWA Consumer Number
ar_ae: رقم المستهلك لدى هيئة الكهرباء والمياه في دبي

# LabelDewaConsumerNumberColon
source: DEWA Consumer Number:
ar_ae: رقم المستهلك لدى هيئة الكهرباء والمياه في دبي

# LabelDu
source: Du
ar_ae: دو

# LabelEmailAddress
source: Email Address
ar_ae: عنوان البريد الإلكتروني

# LabelEmirate
source: Emirate
ar_ae: الإمارة

# LabelEmirateCity
source: Emirate / City
ar_ae: الإمارة / المدينة

# LabelEmiratesIdNo
source: Emirates ID No
ar_ae: بطاقة هوية إماراتية برقم

# LabelEmiratesIdNoColon
source: Emirates ID No:
ar_ae: بطاقة هوية إماراتية برقم

# LabelEmiratesIdUpdated
source: Your Emirates ID has been updated in your record.
ar_ae: تم تحديث بطاقة الهوية الإماراتية في السجل الخاص بك

# LabelEnterAccountNumber
source: Enter another 10 digit account number
ar_ae: أدخل رقم حساب آخر مكون من عشرة أرقام

# LabelEnterAmount
source: Enter Amount
ar_ae: قم بإدخال المبلغ

# LabelEnterCardNumber
source: Enter 16 digits Card Number
ar_ae: ادخل رقم البطاقة المكون من 16 رقما

# LabelEnterOtp
source: Please enter your “One time password”, which has been sent to your registered mobile number
ar_ae: الرجاء ادخال “كلمة المرور لمرة واحدة” والتي تم إرسالها الى رقم هاتفك المتحرك المسجل لدينا

# LabelEnterPin
source: Please enter your 4 digit PIN
ar_ae: الرجاء إدخال رقم التعريف الشخصي الخاص بك و المكون من 4 أرقام

# LabelEtisalat
source: Etisalat
ar_ae: اتصالات

# LabelExceededDeposit
source: The amount deposited exceeds the limit of AED 40,000. Please state a source of fund.
ar_ae: يتجاوز المبلغ الذي تم إيداعه حد الـ 40000 درهم إماراتي. يرجى توضيح مصدر التمويل

# LabelExchangeRateLoading
source: Loading the exchange rate…
ar_ae: تحميل سعر الصرف

# LabelExchangeRateLoadingError
source: An error occurred while loading the exchange rate.
ar_ae: حدث خطأ أثناء تحميل سعر الصرف

# LabelExpiryDate
source: Expiry Date
ar_ae: تاريخ الانتهاء

# LabelExpiryDateColon
source: Expiry Date:
ar_ae: تاريخ الانتهاء

# LabelFillOutInformation
source: Please fill out the following information
ar_ae: يرجى تعبئة المعلومات التالية

# LabelFirsName
source: First Name
ar_ae: الاسم الاول

# LabelFollowInstruction
source: Please follow the instructions from the bank's representative.
ar_ae: الرجاء اتباع التعليمات من مندوب خدمة العملاء لدى المصرف

# LabelFundsTransfer
source: Please choose the type of funds transfer.
ar_ae: يرجى اختيار نوع حوالات الأموال

# LabelHowDidYouHear
source: How did you hear about us?
ar_ae: كيف سمعت عنا؟

# LabelIbanColon
source: IBAN:
ar_ae: رقم الحساب المصرفي الدولي (IBAN)

# LabelIdColon
source: ID:
ar_ae: الهوية

# LabelInsertCreditCard
source: Please insert your credit card.
ar_ae: يرجى إدخال بطاقة الائتمان

# LabelInsertDebitCard
source: Please insert your debit card.
ar_ae: يرجى إدخال بطاقة الخصم المباشر الخاصة بك

# LabelInstallmentAmount
source: Installment Amount
ar_ae: مبلغ القسط

# LabelInstallmentDate
source: Installment Date
ar_ae: تاريخ القسط

# LabelInterestedIn
source: Interested In
ar_ae: مهتم ب

# LabelInterestRateColon
source: Interest Rate:
ar_ae: معدل الربح

# LabelLastName
source: Last Name
ar_ae: الاسم الأخير

# LabelLastStatementDateColon
source: Last Statement Date:
ar_ae: تاريخ اخر كشف حساب

# LabelLastStatementDueColon
source: Last Statement Due:
ar_ae: الكشف الأخير المستحق

# LabelLedgerBalanceColon
source: Ledger Balance:
ar_ae: الرصيد الدفتري

# LabelLimitAmountColon
source: Limit Amount:
ar_ae: مبلغ الحد

# LabelLoanAccountNameColon
source: Loan Account Name:
ar_ae: اسم حساب القرض

# LabelLoanAccountNumberColon
source: Loan Account Number:
ar_ae: رقم حساب القرض

# LabelLoanClosureDateColon
source: Loan Closure Date:
ar_ae: تاريخ إغلاق القرض

# LabelLoanStartDateColon
source: Loan Start Date:
ar_ae: تاريخ بدء القرض

# LabelLoanTenorColon
source: Loan Tenor:
ar_ae: مدة القرض

# LabelLoanTypeColon
source: Loan Type:
ar_ae: نوع القرض

# LabelLookupEmpty
source: We didn't find anything to show here.
ar_ae: لم نعثر على أي شيء ليعرض هنا

# LabelMiddleNameOptional
source: Middle Name (Optional)
ar_ae: الاسم الأوسط (اختياري)

# LabelMinimumAmountDue
source: Minimum Amount Due
ar_ae: الحد الأدنى للمبلغ المستحق

# LabelMinimumAmountDueColon
source: Minimum Amount Due:
ar_ae: الحد الأدنى للمبلغ المستحق

# LabelMobileNo
source: UAE Mobile No
ar_ae: رقم هاتف متحرك إماراتي

# LabelMobileNumber
source: Mobile Number
ar_ae: رقم الهاتف المتحرك

# LabelMobileUpdated
source: Your mobile number has been updated in your record.
ar_ae: تم تحديث رقم هاتفك المحمول في السجل الخاص بك

# LabelMonthlyInstallmentAmountColon
source: Monthly Installment Amount:
ar_ae: مبلغ القسط الشهري

# LabelMonthlySalary
source: Monthly Salary
ar_ae: راتب شهري

# LabelMonths
source: Month(s)
ar_ae: شهر

# LabelNameColon
source: Name:
ar_ae: الاسم

# LabelNationality
source: Nationality
ar_ae: الجنسية

# LabelNeedReceipt
source: Do you need a receipt?
ar_ae: هل تحتاج إلى ايصال ؟

# LabelNewEmail
source: New Email Address
ar_ae: عنوان البريد الإلكتروني الجديد

# LabelNewEmailColon
source: New Email Address:
ar_ae: عنوان البريد الإلكتروني الجديد

# LabelNewEmirateCity
source: New Emirate / City
ar_ae: الإمارة / المدينة الجديدة

# LabelNewEmirateCityColon
source: New Emirate / City:
ar_ae: الإمارة / المدينة الجديدة

# LabelNewEmiratesIdNoColon
source: New Emirates ID No:
ar_ae: رقم الهوية الإماراتية الجديدة

# LabelNewExpiryDate
source: New Expiry Date
ar_ae: تاريخ انتهاء الصلاحية الجديد

# LabelNewMobileNo
source: New Mobile No
ar_ae: رقم الهاتف المتحرك الجديد

# LabelNewMobileNoColon
source: New Mobile No:
ar_ae: رقم الهاتف المتحرك الجديد

# LabelNewPoBoxNo
source: New P.O. Box No
ar_ae: صندوق البريد الجديد

# LabelNewPoBoxNoColon
source: New P.O. Box No:
ar_ae: صندوق البريد الجديد

# LabelNextInstallmentDateColon
source: Next Installment Date:
ar_ae: تاريخ القسط القادم

# LabelNoTransactions
source: No transactions available.
ar_ae: لا توجد عمليات متاحة

# LabelNumberOfMonths
source: Number of Months:
ar_ae: عدد الأشهر

# LabelOpeningBalanceColon
source: Opening Balance:
ar_ae: الرصيد الافتتاحي

# LabelOther
source: Other
ar_ae: أخرى

# LabelOtherCode
source: Other
ar_ae: أخرى

# LabelOutstandingAmount
source: Outstanding Amount
ar_ae: المبلغ الكلي المستحق

# LabelOutstandingBalance
source: Outstanding Balance
ar_ae: المبلغ المستحق
