Repository: TalatMasud-OmniaPayments/BDM
Catalog: BDM-ALRAJHI/Omnia.Pie.Bdm/Omnia.Pie.Bdm.Bootstrapper/Properties/Resources.*.resx
Languages: ar_ae

# LabelReceiptNotAvailable
source: The machine currently can not print the receipt for this transaction, would you like to continue ?
ar_ae: لا يمكن للآلة حاليا طباعة الإيصال لهذه المعاملة، هل ترغب في المتابعة؟

# MessageVATInclusive
source: Fees displayed are inclusive of VAT amount.
ar_ae: الرسوم المبينة تشمل ضريبة القيمة المضافة

# LabelDetailMessageAutoFinance
source: • Sharia’s Compliant • Fast approval process with Competitive profit rates • High finance amount and flexible tenure of up to 5 years • Takaful arrangement and financing • No hidden documentation and study fees • No Salary transfer required
ar_ae: • مطابقة لأحكام الشريعة الإسلامية • موافقات سريعة و معدلات ربح مغريبة • مبالغ تمويل كبيرة و فترات سداد مرنة تصل حتى 5 سنوات • لا توجد أي رسوم دراسة أو وثائق مخفية • تأمين إسلامي تكافلي مع إمكانية التمويل • لا حاجة لتحويل الراتب

# LabelDetailMessageCreditCardLoan
source: • Flights & Hotels • Car Rentals • Shopping & Utility payments • Charity
ar_ae: • تذاكر الطيران و حجوزات الفنادق • إستئجار السيارات • التسوق و دفع الفواتير • الأعمال الخيرية

# LabelDetailMessageHomeFinance
source: • Sharia's Compliant • Fast and simple approval process • Competitive rental rates • Finance amount of up to AED 15 million • Payment tenure up to 25 years • No hidden charges • Property Takaful contribution paid by the bank
ar_ae: • مطابقة لأحكام الشريعة الإسلامية • إجراءات سريعة و بسيطة للموافقة • معدلات إيجار تنافسية • مبالغ تمويلية تصل حتى 15 مليون درهم اماراتي • فترة سداد حتى 25 عاما • لا توجد أي رسوم خفية أو مفاجئة • تأمين إسلامي تكافلي يدفع المصرف قسطه

# LabelForMoreInformationContactDetails
source: For more information, please enter your contact details below
ar_ae: للمزيد من المعلومات، ادخل التفاصيل ادناه الآن

# LabelHeadingMessageAutoFinance
source: We can deliver your dream car in a way that is not only quick and easy but also true to sharia’s values
ar_ae: نقدم لكم في مصرف الراجحي سيارة أحلامكم بأسرع و أسهل طريقة و بأفضل الأسعار و المزايا التي تناسب تطلعاتكم

# LabelHeadingMessageCreditCardLoan
source: Our wide range of Credit cards offers you convenience and advantage in full compliance with Sharia. In addition, get rewarded and earn Joud points that are easy to accrue and can be redeemed in different ways
ar_ae: مجموعتنا الواسعة من بطاقات الإتمان توفر لك الراحة و المزايا الأفضل حيث أنها تتوافق كليا مع أحكام الشريعة الإسلامية، كما سوف تتمتع ببرنامج جود الذي صممناه ليقدم الكثير من المكافئات المجزية، حيث يمكن استبدال نقاطك بكل سهولة بطرق مختلفة:

# LabelHeadingMessageHomeFinance
source: Our Home Finance Products meet your financing needs while staying true to Islamic values
ar_ae: نقدم لكم منتجات التمويل العقاري التي تناسب احتياجاتكم التمويلية و تراعي أحكام الشريعة الإسلامية بحذافيرها

# LabelRepresentativeContact
source: Our representative will contact you soon
ar_ae: سيقوم مندوبنا بالإتصال بك قريبا

# ErrorCardsNotLinked
source: Cards are not linked to your Emirates ID
ar_ae: البطاقات غير مرتبطة بهوية دولة الإمارات الخاصة بك

# LabelUserNameAndPassword
source: Please Enter Your UserName and Password
ar_ae: الرجاء إدخال اسم المستخدم وكلمة المرور الخاصة بك

# MessageFingerperintScan
source: Please scan your finger.
ar_ae: يرجى مسح إصبعك.

# ButtonLogin
source: Login
ar_ae: تسجيل الدخول

# ButtonChangePassword
source: Change Password
ar_ae: تغيير كلمة السر

# ButtonDeposit
source: Deposit
ar_ae: الوديعة

# ButtonUpdateInformation
source: Update Information
ar_ae: تحديث المعلومات

# ButtonCreateUser
source: Create User
ar_ae: إنشاء مستخدم

# ButtonPrintUser
source: Print User
ar_ae: طباعة المستخدم

# LabelNewUserInfo
source: New User Information
ar_ae: معلومات المستخدم الجديد

# LabelPleaseUpdateYourInfo
source: Please Update Your Information
ar_ae: يرجى تحديث المعلومات الخاصة بك

# LabelUpdate
source: Update
ar_ae: تحديث

# ButtonLogout
source: Logout
ar_ae: تسجيل خروج

# LabelUpdateSuccess
source: You have successfully updated your information.
ar_ae: لقد نجحت في تحديث معلوماتك.

# LabeloldnewPassword
source: Please Enter Your Old Password And New Password
ar_ae: لرجاء إدخال كلمة المرور القديمة وكلمة المرور الجديدة

# LabelUser
source: Users
ar_ae: المستعمل

# LabelCreatedUser
source: New user created successfully.
ar_ae: تم إنشاء مستخدم جديد بنجاح

# LabelUpdatePasswordSuccess
source: Password updated successfully.
ar_ae: تم تحديث كلمة السر بنجاح

# MessageFingerperintRegister
source: Please scan your finger to complete the registration.
ar_ae: يرجى مسح إصبعك لإكمال التسجيل.

# LabelRegisterSuccess
source: User registered successfully.
ar_ae: تم تسجيل المستخدم بنجاح.

# LabelLastLogin
source: Last Login
ar_ae: آخر تسجيل دخول

# ErrorInvalidChangePassword
source: Invalid password, Please enter valid old and new password.
ar_ae: كلمة المرور غير صالحة ، يرجى إدخال كلمة مرور قديمة وجديدة صالحة.

# ErrorInvalidFingerprint
source: Invalid fingerprints, please try again.
ar_ae: بصمات الأصابع غير صالحة ، يرجى المحاولة مرة أخرى.

# ErrorInvalidUpdateInfo
source: Unable to update information, Please try again later.
ar_ae: تعذر تحديث المعلومات ، يرجى المحاولة مرة أخرى في وقت لاحق.

# ErrorInvalidUserInfo
source: Unable to create the user. Please try again later.
ar_ae: غير قادر على إنشاء المستخدم. الرجاء معاودة المحاولة في وقت لاحق.

# ErrorInvalidLoginLastTry
source: The username or password is incorrect. This will be your last try.
ar_ae: خطأ في اسم المستخدم أو كلمة السر. ستكون هذه محاولتك الأخيرة.

# ErrorOutOfService
source: This machine is temporarily out of service,\nPlease visit any other al Rajhi machine or branch.
ar_ae: هذا الجهاز خارج الخدمة في الوقت الحالي,يرجى زيارة أحد اجهزة مصرف الراجحي الأخرى أو التفضل بزيارة الفرع

# ErrorEmailAlreadyExists
source: This email is already registered. Please try again with a different email address.
ar_ae: عنوان البريد الإلكترونى هذا مسجل بالفعل. يرجى المحاولة مرة أخرى باستخدام عنوان بريد إلكتروني مختلف.

# ErrorFailUpdatePassword
source: Unable to change password. Please try again later.
ar_ae: غير قادر على تغيير كلمة المرور. الرجاء معاودة المحاولة في وقت لاحق.

# ErrorMobileAlreadyExists
source: This mobile number is already registered. Please try again with a different number.
ar_ae: رقم الهاتف المحمول هذا مسجل بالفعل. يرجى المحاولة مرة أخرى برقم مختلف.

# ErrorUsernameAlreadyExists
source: This username is already registered. Please try again with a different user name.
ar_ae: وسجلت بالفعل اسم المستخدم هذا. يرجى المحاولة مرة أخرى باسم مستخدم مختلف.

# LabelAvailableCapacityColon
source: Notes Available to Deposit:
ar_ae: الملاحظات المتوفرة للإيداع:

# ButtonMaintenanceRole
source: Create Maintenance role
ar_ae: إنشاء دور الصيانة

# ButtonMaintenanceUser
source: Create Maintenance user
ar_ae: إنشاء مستخدم الصيانة

# ErrorNoInternet
source: Network connection not available. Please try again later.
ar_ae: اتصال الشبكة غير متاح. الرجاء معاودة المحاولة في وقت لاحق

# ButtonRePrint
source: Re-Print
ar_ae: إعادة الطباعة

# ErrorInternetInterrupted
source: Something went wrong. Please login and try again.
ar_ae: هناك خطأ ما. يرجى تسجيل الدخول وإعادة المحاولة

# LabelSupervisorLoginSuccess
source: You logged in successfully, please open the cabinet and follow the process for replenishment and maintenance.
ar_ae: لقد قمت بتسجيل الدخول بنجاح ، يرجى فتح الخزانة واتباع عملية التجديد والصيانة.

# LabelAmountDeposited
source: Amount Deposited
ar_ae: المبلغ المودع

# LabelDate
source: Date
ar_ae: تاريخ

# LabelTerminalId
source: Terminal Id
ar_ae: معرف المحطة

# LabelPrint
source: Print
ar_ae: طباعة

# DepositByColon
source: Deposit By:
ar_ae: إيداع بواسطة

# LabelBranchId
source: Branch
ar_ae: فرع شجرة

# LabelInvalidDateMsg
source: The start date cannot be greater than the end date.
ar_ae: لا يمكن أن يكون تاريخ البدء أكبر من تاريخ الانتهاء.

# LabelSelectFinger
source: Please select finger to register account.
ar_ae: الرجاء تحديد إصبع لتسجيل الحساب.

# ErrorFingerScannerNotAvailable
source: Something went wrong. Please login and try again.
ar_ae: هناك خطأ ما. يرجى تسجيل الدخول وإعادة المحاولة
